_app/_drafts/2017-09-05-使用aboboo提取原版电影音频和字幕文件制作anki暗记卡片.html
---
layout: post
title: 使用aboboo提取原版电影音频和字幕文件制作anki暗记卡片
date: 2017-09-05
categories: 
- soft
tags: 
- aboboo
- anki
- card
- film
- mp3
- lrc
- 提取
- 制作
- 卡片
- 暗记
author: yefeiyu
excerpt: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> </h2>
<div class="outline-text-2" id="text-1">
<p>
将电影文件和字幕文件改成同名，放到同一文件夹内。使用aboboo本地-打开，则aboboo在切分语音时自动按字幕时间戳切分。<br >
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> </h2>
<div class="outline-text-2" id="text-2">
<p>
处理字幕。有时候需要原、译文对调；繁体乱码改简体；删除字幕后重新载入等操作。<br >
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> </h2>
<div class="outline-text-2" id="text-3">
<p>
句子选择。打开后反选，然后在第二项中修改为”参照文本大于4个词的句子“，确定。<br >
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> </h2>
<div class="outline-text-2" id="text-4">
<p>
导出选中句子到音频文件，字幕格式为utf-8，勾选自动剪除句子首尾静音，每一句一个句子。<br >
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> </h2>
<div class="outline-text-2" id="text-5">
<p>
使用python，生成anki可以导入的create.csv文件。create.py文件代码如下：<br >
</p>
<pre class="example">
#-*-coding:utf-8-*-
"""
My first python program
"""
import re
import os
import sys
import csv
#from sys import argv
import glob
import time
output = "Tobeimport.csv"
def Main():
    curpath = os.getcwd()
    lrcfiles = curpath + "//*.lrc"
    flist = glob.glob(lrcfiles)
    writer = csv.writer(file(output, 'wb+'))
    pattern1 = re.compile(r'00]([\s\S]*) \t')
    pattern2 = re.compile(r'\t([\s\S]*)')
    i = 0
    for f in flist:
       i = i + 1
       fh = file(f,'r')
       content = fh.read()
       english = pattern1.findall(content)
       chinese = pattern2.findall(content)

       print content

       print english
       print chinese 
       mp3file = f[:-3] + "mp3"
       newname = str(time.time()) + str(i) + ".mp3"
       print mp3file
       print newname
       os.rename(mp3file, newname)
       question = "[sound:" + newname +"]"

       if not english:
	   answer =content[10:]
       else:
	   answer = english[0] + "   " + question
       writer.writerow([question, answer])
       fh.close()
    del writer
      
if __name__ == "__main__":
    Main()
</pre>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> </h2>
<div class="outline-text-2" id="text-6">
<p>
将媒体文件导入anki文件夹内。linux是anki安装后在主文件夹内生成documents文件夹;windows是安装后在user/pc-user-id/AppData/Roaming/Anki2/User 1/collection.media中。<br >
</p>
</div>
</div>
